# brew bundle

brew "git"
brew "ghq"
brew "hub"
brew "tig"
brew "vim"
brew "zsh"
brew "screen"
brew "tree"

# for building ruby
brew "pkg-config"
brew "openssl"
brew "readline"
brew "libyaml"
brew "rust"

brew "zstd"

brew "protobuf"
brew "grpcurl"

brew "node"
brew "fnm"
brew "jq"
brew "docker"
brew "docker-compose"

brew "postgresql"

brew "1password-cli"
