# brew bundle

brew "git"
brew "ghq"
brew "gh"
brew "tig"
brew "vim"
brew "zsh"
brew "screen"
brew "tree"
brew "pstree"
brew "peco"
brew "watch"
brew "wget"

# for building ruby
brew "pkg-config"
brew "openssl"
brew "readline"
brew "libyaml"
brew "rust"

brew "coreutils"
brew "libpq"
brew "tmux"
brew "overmind"

brew "zstd"

brew "protobuf"
brew "grpcurl"

brew "go"
brew "node"
brew "fnm"
brew "uv"
brew "jq"
brew "yq"
brew "docker"
brew "docker-compose"

brew "postgresql"
